---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemAnchorOrientation
source: html/cc219aaa-96ef-9569-81a5-b5c96ca4b633.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemAnchorOrientation Property

"Anchor Orientation"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemAnchorOrientation { get; }
```